/**
 ******************************************************************************
*
* @file   
*
* @brief   
*
* @attention
*
*Copyright (c) 2023 JiuTong.
*
*All rights reserved.
 ******************************************************************************
*/

/*----------------------------------include-----------------------------------*/
#include "timer.h"
/*-----------------------------------macro------------------------------------*/

/*----------------------------------typedef-----------------------------------*/

/*----------------------------------variable----------------------------------*/
uint32_t base_tick = 0; //定义定时基准tick

Timer_HandleTypeDef *timer_list = NULL;
/*-------------------------------------os-------------------------------------*/

/*----------------------------------function----------------------------------*/
/**
 * @brief 定时器更新函数
 *        需要将此函数作为定时触发中断的回调函数，定时更新base_tick
 *        每次更新后比较链表中是否有定时到达，触发对应回调函数
 * 
 */
void timer_update(void){
    base_tick++;
    Timer_HandleTypeDef *p  = timer_list, *q = NULL;
    while(p->next !=NULL){
        if(p->next->triggle_tick <= base_tick){
            //执行回调函数，回调函数要求时间尽可能短
            p->next->func();
            q = p->next;  
            p->next = q->next;
            free(q);
            q = NULL;
        }
    }
}

void timer_insert(uint32_t timeout,void *func);
/*------------------------------------test------------------------------------*/
